tests/load/artillery-quick.yml
# Artillery Quick Load Test
# Test rapido para desarrollo local
#
# Ejecutar con: npx artillery run tests/load/artillery-quick.yml

config:
  target: "http://localhost:7071"
  phases:
    # Test corto: 30 segundos, 10 usuarios/segundo
    - duration: 30
      arrivalRate: 10
      name: "Quick test"

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Health Check Quick"
    weight: 50
    flow:
      - get:
          url: "/api/health"

  - name: "Webhook Quick"
    weight: 50
    flow:
      - post:
          url: "/api/whatsapp-webhook"
          json:
            object: "whatsapp_business_account"
            entry:
              - id: "test123"
                changes:
                  - value:
                      messages:
                        - from: "5215512345678"
                          id: "wamid.test{{ $randomString(10) }}"
                          timestamp: "{{ $timestamp() }}"
                          type: "text"
                          text:
                            body: "Hola"
                    field: "messages"